openfoam_reactor/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       112405;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       112455;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8330;
        startFace       112505;
    }
    electrode_top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8330;
        startFace       120835;
    }
    electrode_bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          8330;
        startFace       129165;
    }
)

// ************************************************************************* //
